Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>Наименование полное Контрагента</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКонтрагента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКонтрагента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Comment>ИНН Контрагента</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Comment>КПП Контрагента</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Comment>Дата рождения</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолКонтрагента</Name>
					<Comment>Пол Контрагента</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.Пол</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Comment>Контактный телефон Контрагента</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Email</Name>
					<Comment>Контактный E-mail Контрагента</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПосещений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ВидыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>ВидыКонтрагентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизическоеЛицо</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>ТипыКонтрагентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Поставщик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Клиент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Контрагенты/Forms/ФормаЭлемента/Ext/Form/Module.bsl
// ++ SMPlekhanov@1bit.com 21.03.2024 [Самообучение]
// ПередЗаписью проверяет заполненность и корректность длины ИНН для юридических и физических лиц.
// Для юридического лица ИНН обязателен и должен содержать ровно 10 цифр. Для физического лица, если ИНН указан,
// он должен содержать ровно 12 цифр.
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Объект.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ВидыКонтрагентов.ЮридическоеЛицо") Тогда 
        Если Не ЗначениеЗаполнено(Объект.ИНН) Или СтрДлина(СокрЛП(Объект.ИНН)) <> 10 Тогда
       	    Сообщить("Для юридического лица ИНН обязателен и должен содержать 10 цифр.");
           	Отказ = Истина;
		КонецЕсли;
		
		// Добавлена проверка КПП для юридических лиц.
		Если Не ЗначениеЗаполнено(Объект.КПП) Тогда
			Сообщить("Для юридического лица КПП обязателен для заполнения.");
        	Отказ = Истина;
		КонецЕсли;
    ИначеЕсли Объект.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ВидыКонтрагентов.ФизическоеЛицо") Тогда
       	Если СтрДлина(Объект.ИНН) > 0 И СтрДлина(СокрЛП(Объект.ИНН)) <> 12 Тогда
       	    Сообщить("Для физического лица ИНН, если указан, должен содержать 12 цифр.");
       	    Отказ = Истина;
		КонецЕсли;         
		
		// Добавлена проверка пола для лиц физических лиц.
		Если Не ЗначениеЗаполнено(Объект.ПолКонтрагента) Тогда
			Сообщить("Для физического лица пол обязателен для заполнения.");
        	Отказ = Истина;
		КонецЕсли;
		
		// Добавлена проверка телефона для лиц физических лиц.
		Если Не ЗначениеЗаполнено(Объект.Телефон) Тогда
			Сообщить("Для физического лица телефон обязателен для заполнения.");
        	Отказ = Истина;
		КонецЕсли;
	КонецЕсли;		
КонецПроцедуры
	
//Процедура ВидКонтрагентаПриИзменении управляет видимостью. 
//Для юридических лиц КПП отображается а Дата рождения скрывается.
&НаКлиенте
Процедура ВидКонтрагентаПриИзменении(Элемент)
	Если Объект.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ВидыКонтрагентов.ЮридическоеЛицо") Тогда
		Элементы.КПП.Видимость = Истина;  
		Элементы.ДатаРождения.Видимость = Ложь;
	Иначе
		Элементы.КПП.Видимость = Ложь;
		Объект.КПП = "";
		Элементы.ДатаРождения.Видимость = Истина;
	КонецЕсли;      
КонецПроцедуры

//Устанавливаем видимость для объектов, которые уже созданы и имеют выбранный вариант контрагента.
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Объект.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ВидыКонтрагентов.ЮридическоеЛицо") Тогда
		Элементы.КПП.Видимость = Истина;  
		Элементы.ДатаРождения.Видимость = Ложь;
	Иначе
		Элементы.КПП.Видимость = Ложь;
		Объект.КПП = "";
		Элементы.ДатаРождения.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры

//Устанавливаем видимость Количества посещений для Контрагентов типа "Клиент".
&НаКлиенте
Процедура ТипКонтрагентаПриИзменении(Элемент)
	Если Объект.ТипКонтрагента = ПредопределенноеЗначение("Перечисление.ТипыКонтрагентов.Клиент") Тогда
		Элементы.КоличествоПосещений.Видимость = Истина;  
	Иначе
		Элементы.КоличествоПосещений.Видимость = Ложь;  
	КонецЕсли;
КонецПроцедуры
// -- SMPlekhanov@1bit.com 21.03.2024 [Самообучение]
